In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('nyc_weather.csv')
df

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [3]:
df["Temperature"].max()

50

In [4]:
df['EST'][df['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [5]:
df['WindSpeedMPH'].mean()

6.892857142857143

In [6]:
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
weather_data=[('1/1/2017',32,6,'Rain'),
             ('1/2/3017',35,7,'Sunny'),
             ('1/3/3017',28,2,'Snow'),
             ('1/4/3017',24,7,'Snow'),
             ('1/5/3017',32,4,'Rain'),
             ('1/6/3017',31,2,'Sunny')]
df=pd.DataFrame(weather_data,columns=['day','temp','windspeed','event'])
df

        day  temp  windspeed  event
0  1/1/2017    32          6   Rain
1  1/2/3017    35          7  Sunny
2  1/3/3017    28          2   Snow
3  1/4/3017    24          7   Snow
4  1/5/3017    32          4   Rain
5  1/6/3017    31          2  Sunny

In [8]:
df.shape

(6, 4)

In [9]:
df.head(2)

        day  temp  windspeed  event
0  1/1/2017    32          6   Rain
1  1/2/3017    35          7  Sunny

In [10]:
df.tail(2)

        day  temp  windspeed  event
4  1/5/3017    32          4   Rain
5  1/6/3017    31          2  Sunny

In [11]:
df[2:]

        day  temp  windspeed  event
2  1/3/3017    28          2   Snow
3  1/4/3017    24          7   Snow
4  1/5/3017    32          4   Rain
5  1/6/3017    31          2  Sunny

In [12]:
df.describe()

            temp  windspeed
count   6.000000   6.000000
mean   30.333333   4.666667
std     3.829708   2.338090
min    24.000000   2.000000
25%    28.750000   2.500000
50%    31.500000   5.000000
75%    32.000000   6.750000
max    35.000000   7.000000

In [13]:
df.columns

Index(['day', 'temp', 'windspeed', 'event'], dtype='object')

In [14]:
df.day

0    1/1/2017
1    1/2/3017
2    1/3/3017
3    1/4/3017
4    1/5/3017
5    1/6/3017
Name: day, dtype: object

In [15]:
df['day']

0    1/1/2017
1    1/2/3017
2    1/3/3017
3    1/4/3017
4    1/5/3017
5    1/6/3017
Name: day, dtype: object

In [16]:
df[df.temp==35]

        day  temp  windspeed  event
1  1/2/3017    35          7  Sunny

In [17]:
df['temp']==35

0    False
1     True
2    False
3    False
4    False
5    False
Name: temp, dtype: bool

In [18]:
df[df.temp==35]

        day  temp  windspeed  event
1  1/2/3017    35          7  Sunny

In [19]:
df[['day','event']]

        day  event
0  1/1/2017   Rain
1  1/2/3017  Sunny
2  1/3/3017   Snow
3  1/4/3017   Snow
4  1/5/3017   Rain
5  1/6/3017  Sunny

In [20]:
df['temp']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temp, dtype: int64

In [21]:
df['temp'].max()

35

In [22]:
df['temp'].min()

24

In [23]:
df[df['temp']==df['temp'].min()]

        day  temp  windspeed event
3  1/4/3017    24          7  Snow

In [24]:
sr=pd.Series([10,20,30,40,50])
print(type(sr))

<class 'pandas.core.series.Series'>

In [25]:
rm=pd.Series()

/tmp/ipykernel_6253/381041605.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  rm=pd.Series()

In [26]:
import numpy as np
data=np.array(['a','m','v','d'])
s=pd.Series(data)
s

0    a
1    m
2    v
3    d
dtype: object

In [27]:
import numpy as np
data=np.array(['a','m','v','d'])
s=pd.Series(data,index=[100,101,102,103])
s

100    a
101    m
102    v
103    d
dtype: object

In [28]:
data={'a':0,'b':1,'c':2}

In [29]:
s1=pd.Series(data,index=['a','b','c','d'])

In [30]:
s1

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [31]:
df=pd.DataFrame({'Name':['Test','Demo','Admin','John',"Manager"],"Age":[10,20,30,40,50]})

In [32]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [33]:
df

      Name  Age
0     Test   10
1     Demo   20
2    Admin   30
3     John   40
4  Manager   50

In [34]:
data=np.random.rand(2,4,5)
data

array([[[0.33250315, 0.97357104, 0.75075908, 0.0408111 , 0.47030032],
        [0.80918943, 0.86726274, 0.362364  , 0.17714255, 0.17086231],
        [0.18884121, 0.52738324, 0.43032358, 0.79930153, 0.7317158 ],
        [0.76012708, 0.91041439, 0.63951244, 0.87886828, 0.42073799]],

       [[0.00912609, 0.37861697, 0.3794298 , 0.07218953, 0.3037251 ],
        [0.53823202, 0.2412269 , 0.91810546, 0.2895065 , 0.46827665],
        [0.70875109, 0.06998068, 0.14981828, 0.49684494, 0.14187062],
        [0.82377966, 0.56527269, 0.67077689, 0.80086817, 0.8526291 ]]])

In [36]:
dt={'Name':pd.Series(['Tom','James','Ricky','Messi','Steve','Smith','lack']),
   'Age':pd.Series([25,26,25,23,30,29,23])}

## Indexing Pandas

In [37]:
df= pd.DataFrame(np.random.rand(8,4),index=['a','b','c','d','e','f','g','h'],
                columns=['A',"B",'C','D'])

In [38]:
df

          A         B         C         D
a  0.426813  0.675815  0.917841  0.087123
b  0.576976  0.704533  0.523496  0.920289
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341
g  0.994572  0.617072  0.930478  0.673822
h  0.001005  0.160326  0.646816  0.538407

In [39]:
df.iloc[4:6,:]

          A         B         C         D
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341

In [40]:
df.iloc[-3,-3]

0.7623549209972674

In [42]:
df.head()

          A         B         C         D
a  0.426813  0.675815  0.917841  0.087123
b  0.576976  0.704533  0.523496  0.920289
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395

In [43]:
df[['A','B']]

          A         B
a  0.426813  0.675815
b  0.576976  0.704533
c  0.200091  0.889078
d  0.368708  0.847855
e  0.570063  0.309091
f  0.965502  0.762355
g  0.994572  0.617072
h  0.001005  0.160326

In [44]:
df.loc[:,"A"]

a    0.426813
b    0.576976
c    0.200091
d    0.368708
e    0.570063
f    0.965502
g    0.994572
h    0.001005
Name: A, dtype: float64

In [45]:
df.loc[:,['A','C']]

          A         C
a  0.426813  0.917841
b  0.576976  0.523496
c  0.200091  0.256603
d  0.368708  0.802317
e  0.570063  0.559081
f  0.965502  0.161067
g  0.994572  0.930478
h  0.001005  0.646816

In [46]:
df.loc[['a','c'],['A','C']]

          A         C
a  0.426813  0.917841
c  0.200091  0.256603

In [47]:
df.head()

          A         B         C         D
a  0.426813  0.675815  0.917841  0.087123
b  0.576976  0.704533  0.523496  0.920289
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395

In [48]:
df.loc['b':]

          A         B         C         D
b  0.576976  0.704533  0.523496  0.920289
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341
g  0.994572  0.617072  0.930478  0.673822
h  0.001005  0.160326  0.646816  0.538407

In [49]:
df.loc['c':'f']

          A         B         C         D
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341

In [50]:
df.loc['a':'h':2]

          A         B         C         D
a  0.426813  0.675815  0.917841  0.087123
c  0.200091  0.889078  0.256603  0.883712
e  0.570063  0.309091  0.559081  0.017395
g  0.994572  0.617072  0.930478  0.673822

In [51]:
df.loc[:,'A']

a    0.426813
b    0.576976
c    0.200091
d    0.368708
e    0.570063
f    0.965502
g    0.994572
h    0.001005
Name: A, dtype: float64

In [52]:
df.loc[:,'B':]

          B         C         D
a  0.675815  0.917841  0.087123
b  0.704533  0.523496  0.920289
c  0.889078  0.256603  0.883712
d  0.847855  0.802317  0.675344
e  0.309091  0.559081  0.017395
f  0.762355  0.161067  0.267341
g  0.617072  0.930478  0.673822
h  0.160326  0.646816  0.538407

In [53]:
df.loc[:,'A'::2]

          A         C
a  0.426813  0.917841
b  0.576976  0.523496
c  0.200091  0.256603
d  0.368708  0.802317
e  0.570063  0.559081
f  0.965502  0.161067
g  0.994572  0.930478
h  0.001005  0.646816

In [54]:
df.loc[::2,::2]

          A         C
a  0.426813  0.917841
c  0.200091  0.256603
e  0.570063  0.559081
g  0.994572  0.930478

In [59]:
df.loc[::-2,::-1]

          D         C         B         A
h  0.538407  0.646816  0.160326  0.001005
f  0.267341  0.161067  0.762355  0.965502
d  0.675344  0.802317  0.847855  0.368708
b  0.920289  0.523496  0.704533  0.576976

In [58]:
df.loc[:,::-1]

          D         C         B         A
a  0.087123  0.917841  0.675815  0.426813
b  0.920289  0.523496  0.704533  0.576976
c  0.883712  0.256603  0.889078  0.200091
d  0.675344  0.802317  0.847855  0.368708
e  0.017395  0.559081  0.309091  0.570063
f  0.267341  0.161067  0.762355  0.965502
g  0.673822  0.930478  0.617072  0.994572
h  0.538407  0.646816  0.160326  0.001005

In [60]:
df.loc[df.index[-1],:]

A    0.001005
B    0.160326
C    0.646816
D    0.538407
Name: h, dtype: float64

In [62]:
df.loc[:,df.columns[-1]]

a    0.087123
b    0.920289
c    0.883712
d    0.675344
e    0.017395
f    0.267341
g    0.673822
h    0.538407
Name: D, dtype: float64

In [63]:
df.loc[df.index[-1],df.columns[-1]]

0.5384073873816017

In [64]:
df.index[-2]

'g'

In [65]:
df.columns[-1]

'D'

In [66]:
df.iloc[:,:-2]

          A         B
a  0.426813  0.675815
b  0.576976  0.704533
c  0.200091  0.889078
d  0.368708  0.847855
e  0.570063  0.309091
f  0.965502  0.762355
g  0.994572  0.617072
h  0.001005  0.160326

In [67]:
df.iloc[:-2,:]

          A         B         C         D
a  0.426813  0.675815  0.917841  0.087123
b  0.576976  0.704533  0.523496  0.920289
c  0.200091  0.889078  0.256603  0.883712
d  0.368708  0.847855  0.802317  0.675344
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341

In [68]:
df.iloc[:2,:2]

          A         B
a  0.426813  0.675815
b  0.576976  0.704533

In [69]:
df.iloc[0::2,0::2]

          A         C
a  0.426813  0.917841
c  0.200091  0.256603
e  0.570063  0.559081
g  0.994572  0.930478

In [70]:
df.iloc[0,0]

0.42681299740620615

In [71]:
df.iloc[-1,-1]

0.5384073873816017

In [72]:
df.iloc[:,2:3]

          C
a  0.917841
b  0.523496
c  0.256603
d  0.802317
e  0.559081
f  0.161067
g  0.930478
h  0.646816

In [73]:
df.iloc[4:6,:]

          A         B         C         D
e  0.570063  0.309091  0.559081  0.017395
f  0.965502  0.762355  0.161067  0.267341

# Data frame groupby concat and append and Merge

In [75]:
ipl_data={'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Riders','Royals','Royals','Riders','Kings'],
         'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
         'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,678,714,812,756,788,694,701,804,690]}
df=pd.DataFrame(ipl_data)

In [76]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     678
4    Kings     3  2014     714
5    Kings     4  2015     812
6    Kings     1  2016     756
7   Riders     1  2017     788
8   Royals     2  2016     694
9   Royals     4  2014     701
10  Riders     1  2015     804
11   Kings     2  2017     690

In [77]:
df.groupby(['Team']).count()

        Rank  Year  Points
Team
Devils     2     2       2
Kings      4     4       4
Riders     4     4       4
Royals     2     2       2

In [78]:
df.groupby(['Team'])['Points'].sum()

Team
Devils    1541
Kings     2972
Riders    3257
Royals    1395
Name: Points, dtype: int64

In [79]:
df.groupby(['Team'])['Points'].mean()

Team
Devils    770.50
Kings     743.00
Riders    814.25
Royals    697.50
Name: Points, dtype: float64

In [80]:
df.groupby(['Team'])['Points'].min()

Team
Devils    678
Kings     690
Riders    788
Royals    694
Name: Points, dtype: int64

In [81]:
df.groupby(['Team'])['Points'].max()

Team
Devils    863
Kings     812
Riders    876
Royals    701
Name: Points, dtype: int64

In [82]:
df.groupby(['Team'])['Points'].count()

Team
Devils    2
Kings     4
Riders    4
Royals    2
Name: Points, dtype: int64

In [83]:
df.groupby(by="Year",dropna=False)['Points'].sum()

Year
2014    3154
2015    3083
2016    1450
2017    1478
Name: Points, dtype: int64

In [93]:
gk=df.groupby(['Team','Year'])

In [94]:
gk.first()

             Rank  Points
Team   Year
Devils 2014     2     863
       2015     3     678
Kings  2014     3     714
       2015     4     812
       2016     1     756
       2017     2     690
Riders 2014     1     876
       2015     2     789
       2017     1     788
Royals 2014     4     701
       2016     2     694

In [95]:
for i in gk:
    print(i)

(('Devils', 2014),      Team  Rank  Year  Points
2  Devils     2  2014     863)
(('Devils', 2015),      Team  Rank  Year  Points
3  Devils     3  2015     678)
(('Kings', 2014),     Team  Rank  Year  Points
4  Kings     3  2014     714)
(('Kings', 2015),     Team  Rank  Year  Points
5  Kings     4  2015     812)
(('Kings', 2016),     Team  Rank  Year  Points
6  Kings     1  2016     756)
(('Kings', 2017),      Team  Rank  Year  Points
11  Kings     2  2017     690)
(('Riders', 2014),      Team  Rank  Year  Points
0  Riders     1  2014     876)
(('Riders', 2015),       Team  Rank  Year  Points
1   Riders     2  2015     789
10  Riders     1  2015     804)
(('Riders', 2017),      Team  Rank  Year  Points
7  Riders     1  2017     788)
(('Royals', 2014),      Team  Rank  Year  Points
9  Royals     4  2014     701)
(('Royals', 2016),      Team  Rank  Year  Points
8  Royals     2  2016     694)

In [96]:
t=df.groupby('Year')
t

In [97]:
t.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     714
9  Royals     4  2014     701

In [98]:
t.get_group(2015)

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     678
5    Kings     4  2015     812
10  Riders     1  2015     804

In [99]:
t['Points'].mean()

Year
2014    788.50
2015    770.75
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [100]:
t=df.groupby('Team')
t

In [101]:
t["Points"].agg([np.sum,np.mean,np.std,np.min,np.max,np.size])

         sum    mean         std  amin  amax  size
Team
Devils  1541  770.50  130.814755   678   863     2
Kings   2972  743.00   53.478968   690   812     4
Riders  3257  814.25   41.812080   788   876     4
Royals  1395  697.50    4.949747   694   701     2

In [102]:
df.groupby('Team').filter(lambda x: len(x)>=3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     714
5    Kings     4  2015     812
6    Kings     1  2016     756
7   Riders     1  2017     788
10  Riders     1  2015     804
11   Kings     2  2017     690